[{"id":1643485858,"layout":"blog\r","title":"Discovering the globe\r","date":"2022-01-29 18:50:58 -0100","thumbnail":"/images/uploads/img_20211207_160043.jpg\r","content":"## History of travel\r\n\r\nTravel dates back to antiquity where wealthy Greeks and Romans would travel for leisure to their summer homes and villas in cities such as Pompeii and Baiae. While early travel tended to be slower, more dangerous, and more dominated by trade and migration, cultural and technological advances over many years have tended to mean that travel has become easier and more accessible. Mankind has come a long way in transportation since Christopher Columbus sailed to the new world from Spain in 1492, an expedition which took over 10 weeks to arrive at the final destination; to the 21st century where aircraft allow travel from Spain to the United States overnight.\r\n\r\nTravel in the Middle Ages offered hardships and challenges, however, it was important to the economy and to society. The wholesale sector depended (for example) on merchants dealing with/through caravans or sea-voyagers, end-user retailing often demanded the services of many itinerant peddlers wandering from village to hamlet, gyrovagues (Wandering Monks) and wandering friars brought theology and pastoral support to neglected areas, traveling minstrels practiced the never-ending tour, and armies ranged far and wide in various crusades and in sundry other wars. Pilgrimages were common in both the European and Islamic world and involved streams of travelers both locally (Canterbury Tales-style) and internationally.\r\n\r\nIn the late 16th century it became fashionable for young European aristocrats and wealthy upper-class men to travel to significant European cities as part of their education in the arts and literature. This was known as the Grand Tour, it included cities such as London, Paris, Venice, Florence, and Rome. However, The French Revolution brought with it the end of the Grand Tour.\r\n\r\nTravel by water often provided more comfort and speed than land-travel, at least until the advent of a network of railways in the 19th century. Travel for the purpose of tourism is reported to have started around this time when people began to travel for fun as travel was no longer a hard and challenging task. This was capitalized on by people like Thomas Cook selling tourism packages where trains and hotels were booked together. Airships and airplanes took over much of the role of long-distance surface travel in the 20th century, notably after the Second World War where there was a surplus of both aircraft and pilots. Indeed, air travel has become so ubiquitous in the 21st century that one woman, Alexis Alford, visited all 196 countries before the age of 21."},{"id":1643394609,"layout":"blog\r","title":"Zima današnja pomlad\r","date":"2022-01-28 17:30:09 -0100","thumbnail":"/images/uploads/img_20211207_161907.jpg\r","content":"# Carimbo\r\n\r\n[](https://en.wikipedia.org/wiki/File:Grupo_Conquista_de_Carimb%C3%B3.jpg \"Enlarge\")\r\n\r\nCarimbó is a Brazilian dance. The dance was common in the northern part of Brazil,\\[1] from the time that Brazil was still a Portuguese colony, originally from the Brazilian region of Pará, around Marajó island and the capital city of Belém.\r\n\r\nCarimbó was a loose and very sensual dance which involved only side to side movements and many spins and hip movement by the female dancer, who typically wore a rounded skirt. The music was mainly to the beat of Carimbó drums. In this dance, a woman would throw her handkerchief on the floor and her male partner would attempt to retrieve it using solely his mouth.\r\n\r\nOver time, the dance changed, as did the music itself. It was influenced by the Caribbean (for example, Zouk, and Merengue styles) and French/Spanish dance styles of the Caribbean, especially Cumbia from Colombia.\r\n\r\nThe style survives today, with Caribbean radio stations in the northern states of Brazil, such as Amapá, playing the music. The Carimbó style has formed the basis of some new rhythms like the *Sirimbó*, the *Lari Lari* and the Lambada."},{"id":1643313229,"layout":"blog\r","title":"Constructing something beautiful\r","date":"2022-01-27 18:53:49 -0100","thumbnail":"/images/uploads/img_20211207_160240.jpg\r","content":"# Modern capitalist society\r\n\r\nModern capitalist society is a term used to describe a type of capitalist society in which a capitalist class of \"new elites\" and \"old elites\" concerned with maximizing their wealth secures a political system that serves and protects their interests, leading to the development of a wage-earning class. The term is commonly used by historians to refer to a transition from a premodern feudal society to a modern capitalist society, with consensus being that England emerged as the first modern capitalist society through the English Civil War (1642-51) and the Glorious Revolution (1688-89). Historians identify that the transition into modern capitalist society is often defined by a bourgeois revolution in which rising elites secure a system of representative democracy, rather than direct democracy, that serves their interests over the interests of the previously ruling royal aristocracy, such as in the American Revolution.\r\n\r\nModern capitalist societies rely on calculated and systematic production, different from the merchant capitalism of the Italian city-states, and are defined by the existence of a wage-earning class that functions as the counterpart to a capitalist class. They are described as highly competitive and individualistic, focusing on private interests over public welfare, through prioritizing commodity production and profit maximization. Defending private property, preserving law and order, maintaining the economic exploitation and political impotence of the wage-earning class, training the wage-earning class in the tasks that modern capitalist society requires to function, educating the wage-earning class to internalize the principles of capitalist-democracy, often through forms of propaganda in the mass media, and conditioning the wage-earning class to believe that they are autonomous and live in a society ruled by the citizenry, have all been identified by scholars as forces which maintain modern capitalist societies.\r\n\r\nModern capitalist societies are positioned in Western culture as a phase of human progression that is superior or \"more advanced\" than \"premodern\" forms of society. This perspective was most evidently portrayed through colonial logics which asserted that Indigenous peoples belonged to more \"primitive\" cultures and therefore should assimilate into more \"civilized\" societies or face genocide (e.g., \"Kill the Indian, Save the Man\"). For Marxists, anarchists, and others, modern capitalist society is a phase which will eventually lead to the emergence of a qualitatively different form of society. In opposition, liberals and others are opposed to the structural transformation of modern capitalist society."},{"id":1643112377,"layout":"blog\r","title":"Just have fun!\r","date":"2022-01-25 11:06:17 -0100","thumbnail":"/images/uploads/imgNotFound.jpg\r","content":"# Psychology of fun\r\n\r\nAccording to Johan Huizinga, fun is \"an absolutely primary category of life, familiar to everybody at a glance right down to the animal level.\" Psychological studies reveal both the importance of fun and its effect on the perception of time, which is sometimes said to be shortened when one is having fun. As the adage states: \"Time flies when you're having fun\".\r\n\r\nIt has been suggested that games, toys, and activities perceived as fun are often challenging in some way. When a person is challenged to think consciously, overcome challenge and learn something new, they are more likely to enjoy a new experience and view it as fun. A change from routine activities appears to be at the core of this perception, since people spend much of a typical day engaged in activities that are routine and require limited conscious thinking. Routine information is processed by the brain as a \"chunked pattern\": \"We rarely look at the real world\", according to game designer Raph Koster, \"we instead recognize something we have chunked, and leave it at that. \\[...] One might argue that the essence of much of art is in forcing us to see things as they really are rather than as we assume them to be\". Since it helps people to relax, fun is sometimes regarded as a \"social lubricant\", important in adding \"to one's pleasure in life\" and helping to \"act as a buffer against stress\".\r\n\r\nFor children, fun is strongly related to play and they have great capacity to extract the fun from it in a spontaneous and inventive way. Play \"involves the capacity to have fun – to be able to return, at least for a little while, to never-never land and enjoy it."},{"id":1643069668,"layout":"blog\r","title":"A post on happiness\r","date":"2022-01-24 23:14:28 -0100","thumbnail":"/images/uploads/img_20220124_182725.jpg\r","content":"## Biological role of seratonine\r\n\r\nSerotonin is involved in numerous physiological processes, including sleep, thermoregulation, learning and memory, pain, (social) behavior, sex, feeding, motor activity, biological rhythms and possibly others. In less complex animals, such as some invertebrates, serotonin regulates feeding and other processes. In plants serotonin synthesis seems to be associated with stress signals.\r\n\r\n### Cellular effects\r\n\r\nSerotonin primarily acts through its receptors and its effects depend on which cells and tissues express these receptors (see below).\r\n\r\n#### Receptors\\\r\n\r\nMain article: 5-HT receptor\r\n\r\nThe 5-HT receptors, the receptors for serotonin, are located on the cell membrane of nerve cells and other cell types in animals, and mediate the effects of serotonin as the endogenous ligand and of a broad range of pharmaceutical and psychedelic drugs. Except for the 5-HT3 receptor, a ligand-gated ion channel, all other 5-HT receptors are G-protein-coupled receptors (also called seven-transmembrane, or heptahelical receptors) that activate an intracellular second messenger cascade."},{"id":1642192933,"layout":"blog\r","title":"Gremo kajtat z novim datumom\r","date":"2022-01-14 19:42:13 -0100","thumbnail":"/images/uploads/img_20211207_160805.jpg\r","content":"# Sex ratio\r\n\r\nMost organisms which reproduce sexually have a 1:1 sex ratio of male and female births. The English statistician and biologist Ronald Fisher outlined why this is so in what has come to be known as Fisher's principle. This essentially says the following:\r\n\r\n* 1. Suppose male births are less common than female.\r\n  2. A newborn male then has better mating prospects than a newborn female, and therefore can expect to have more offspring.\r\n  3. Therefore parents genetically disposed to produce males tend to have more than average numbers of grandchildren born to them.\r\n  4. Therefore the genes for male-producing tendencies spread, and male births become more common.\r\n  5. As the 1:1 sex ratio is approached, the advantage associated with producing males dies away.\r\n  6. The same reasoning holds if females are substituted for males throughout. Therefore 1:1 is the equilibrium ratio."},{"id":1640189838,"layout":"blog\r","title":"Časovno uvščen\r","date":"2021-12-22 15:17:18 -0100","thumbnail":"/images/uploads/img_20220124_182317.jpg\r","content":"# Sex in French Polinesya\r\n\r\nThe Islands have been noted for their sexual culture. Many sexual activities seen as taboo in western cultures were viewed as appropriate by the native culture. Contact with Western societies has changed many of these customs, so research into their pre-Western social history has to be done by reading antique writings.\r\n\r\nChildren slept in the same room as their parents and were able to witness their parents while they had sex. Intercourse simulation became real penetration as soon as boys were physically able. Adults found simulation of sex by children to be funny. As children approached 11 attitudes shifted toward girls. Premarital sex was not encouraged but was allowed in general, restrictions on adolescent sexuality were incest, exogamy regulations, and firstborn daughters of high-ranking lineage. After their firstborn child, high-ranking women were permitted extramarital affairs.\r\n\r\n> The next day, as soon as it was light, we were surrounded by a still greater multitude of these people. There were now a hundred females at least; and they practised all the arts of lewd expression and gesture, to gain admission on board. It was with difficulty I could get my crew to obey the orders I had given on this subject. Amongst these females were some not more than ten years of age. But youth, it seems, is here no test of innocence; these infants, as I may call them, rivalled their mothers in the wantonness of their motions and the arts of allurement.\r\n>\r\n> — Yuri Lisyansky in his memoirs\r\n\r\nAdam Johann von Krusenstern in his book about the same expedition as Yuri's, reports that a father brought a 10-12-year-old girl on his ship, and she had sex with the crew. According to the book of Charles Pierre Claret de Fleurieu and Étienne Marchand, 8-year-old girls had sex and performed other sexual acts in public."},{"id":1631793720,"layout":"blog\r","title":"New date format\r","date":"2021-09-16 11:02:00 -0100","thumbnail":"/images/uploads/img_20211207_160905.jpg\r","content":"# Nature of work as developer\r\n\r\nComputer programmers write, test, debug, and maintain the detailed instructions, called computer programs, that computers must follow to perform their functions. Programmers also conceive, design, and test logical structures for solving problems by computer. Many technical innovations in programming — advanced computing technologies and sophisticated new languages and programming tools — have redefined the role of a programmer and elevated much of the programming work done today. Job titles and descriptions may vary, depending on the organization.\r\n\r\nProgrammers work in many settings, including corporate information technology (IT) departments, big software companies, small service firms and government entities of all sizes. Many professional programmers also work for consulting companies at client sites as contractors. Licensing is not typically required to work as a programmer, although professional certifications are commonly held by programmers. Programming is widely considered a profession (although some[*who?*] authorities disagree on the grounds that only careers with legal licensing requirements count as a profession).\r\n\r\nProgrammers' work varies widely depending on the type of business for which they are writing programs. For example, the instructions involved in updating financial records are very different from those required to duplicate conditions on an aircraft for pilots training in a flight simulator. Simple programs can be written in a few hours. More complex ones may require more than a year of work, while others are never considered 'complete' but rather are continuously improved as long as they stay in use. In most cases, several programmers work together as a team under a senior programmer's supervision.\r\n\r\nProgrammers write programs according to the specifications determined primarily by more senior programmers or systems analysts. After the design process is complete, it is the job of the programmer to convert that design into a logical series of instructions that the computer can follow. The programmer codes these instructions in one of many programming languages. Different programming languages are used depending on the purpose of the program. COBOL, for example, is commonly used for business applications that typically run on mainframe and midrange computers, whereas Fortran is used in science and engineering. C++ and Python are widely used for both scientific and business applications. Java, C#, JavaScript and PHP are popular programming languages for Web and business applications. Programmers generally know more than one programming language and, because many languages are similar, they often can learn new languages relatively easily. In practice, programmers often are referred to by the language they know, e.g. as *Java programmers*, or by the type of function they perform or the environment in which they work: for example, *database programmers*, *mainframe programmers*, or web developers.\r\n\r\nWhen making changes to the source code that defines the program, programmers need to make other programmers aware of the task that the routine is to perform. They do this by writing software documentation and by inserting comments in the source code so that others can understand the program more easily. To save time, programmers often use libraries of basic code that can be modified or customized for a specific application. This approach yields more reliable and consistent programs and increases programmers' productivity by eliminating some routine steps."},{"id":1573474015,"layout":"blog\r","title":"Justed learned to fly!\r","date":"2019-11-11 11:06:55 -0100","thumbnail":"/images/uploads/img_20211207_161450.jpg\r","content":"# Physical practice\r\n\r\nKiteboarding is seen as a mid to high intensity exercise, but freeriding can be a low intensity practice like walking, and is usually done in long sessions of up to 2–3 hours. It is amenable to almost all ages, at least from teenagers up to 70 years old or more.[58] It can be seen as a supplement or a substitute for other fitness practices.\r\n\r\n### Safety\r\nPower kites are powerful enough to pull the rider like a boat in wakeboarding and to lift their users to diving heights. An uncontrolled kite can be dangerous, especially in environments with contudent obstacles. A rider can lose control from falling or from sudden wind gusts, which can occur in the presence of strong winds from squalls or storms (\"collard\").\r\n\r\nIt is possible to be seriously injured after being lofted, dragged, carried off, blown downwind or dashed, resulting in a collision with hard objects including sand, buildings, terrain or power lines or even by hitting the water surface with sufficient speed or height (\"kitemare\", a portmanteau of kite and nightmare). Adequate quality professional kiteboarding training, careful development of experience and consistent use of good judgement and safety gear should result in fewer problems in kiteboarding."}]